<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// blog子域名绑定到blog模块
// 
return [
    '__pattern__'    => [
        'name' => '\w+',
    ],
    ':short_url_key' => ['cmd/oauth/shorturl', ['method' => 'get'], ['short_url_key' => '[a-z0-9A-Z]{6}']], //短地址的url

];
